content-org/posts/all-posts.org
#+hugo_base_dir: ../../
#+hugo_section: posts
#+seq_todo: TODO DRAFT DONE
#+property: header-args :eval no

#+startup: indent
#+startup: content

# https://ox-hugo.scripter.co/doc/org-meta-data-to-hugo-front-matter/

# Macros
#+macro: doc [[https://ox-hugo.scripter.co/doc/$1][$2]]
#+macro: oxhugoissue =ox-hugo= Issue #[[https://github.com/kaushalmodi/ox-hugo/issues/$1][$1]]
#+macro: hugoissue =hugo= Issue #[[https://github.com/gohugoio/hugo/issues/$1][$1]]
#+macro: hugopr =hugo= PR #[[https://github.com/gohugoio/hugo/pull/$1][$1]]
#+macro: bfissue /Blackfriday/ Issue #[[https://github.com/russross/blackfriday/issues/$1][$1]]
#+macro: commit commit [[https://github.com/kaushalmodi/ox-hugo/commit/$1][$1]]
#+macro: latex @@html:<span class="latex">L<sup>a</sup>T<sub>e</sub>X</span>@@

#+AUTHOR: Louis Tsiattalou

** DONE Learning How to Learn Notes IV: Becoming a Better Learner :LearningHowtoLearn:
CLOSED: [2020-02-04 Tue 18:53]
:PROPERTIES:
:EXPORT_FILE_NAME: learning-how-to-learn-4
:CUSTOM_ID: learning-how-to-learn-4
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :type post
:END:

The final week of the course is mostly centered around developing techniques for
becoming a better learner, as well as providing some specific ideas for how to
optimise for tests (which are irrelevant to me now, but worth keeping in mind
anyway).

*** Top Tips for Improving Learning
**** Physical Exercise
Neurons are not just generated at birth to remain in your brain for all time.
There's a lot more to it; this was the previous dogma, but we know that neurons
are born all the time, at the same time as the strengthening of old neurons.

However, if they aren't used, they die. Can't be taking up any unnecessary
resources after all. However, both *exercise* and *new experiences* sustain
their creation and prolong their life.

It's just generally a good idea...
**** Practice Makes Perfect
Unfortunately, the existence of the /critical period/ for learning is true. The
brain's critical period for language learning is approximately up to the age of
13, for instance. During the /critical period/, neurons are created at an
accelerated rate.

However, don't be discouraged! The passing of the critical period doesn't mean
that you can't learn what you missed! It has recently been proven that those who
missed out on the development of stereo-vision (through blindness in one eye for
instance) in the critical period of 0-24 months can redevelop it later on in
life through *deliberate practice*.

More tips can be found on [[https://brainfacts.org/][BrainFacts]].
*** Learning Techniques & Quirks
**** Regression of Understanding
A certain quirk we face is the /regression of understanding/. We're all familiar
with this; "Why am I worse at this now than I was yesterday?"

Plenty of research has been conducted about this. The evidence seems to suggest
that this situation comes about when our brain is restructuring itself around
the information to enable a deeper understanding of the material; moving chunks,
generating new neuronal links, etc.

When you experience the /regression of understanding/, rest easy; a great step
change in understanding is likely to follow as a result of this mental
restructuring!
**** Metaphors & Analogies
In [[#learning-how-to-learn-3][Week 3]], we discussed how grouping helps solidify memory and
therefore synthesis. It benefits chunk formation.

Metaphors and Analofies are simply constructs to help facilitate a grouping
through similarity. They therefore help with imagination, much like the mnemonic
techniques for chunking discussed in [[#learning-how-to-learn-2][Week 2]] possible with these analogies;
having a /really/ novel analogy paves the way for neuronal links where none have
been formed before, further strengthening capacity for creativity.

After mastery is gained (ie: the chunk is formed), you can happily discard your
metaphor/analogy, or change them around to create even more "out-there"
analogies. Metaphors and Analogies are fantastic for creating versatile chunks
and memories, that don't fall into the Einstellung trap discussed in Week 2;
where you fall into a pattern of thinking that you can't break out of.
**** Impostor Syndrome
Chunking is mostly the same between learning sciences and learning sports. In
both cases, practicing through repetition and application generates chunks. It's
not about listening /really intently at your teacher/; do you get better at Free
Kicks by listening to trigonomic explanations of trajectories and visualising
where to kick the ball? This knowledge has it's place, but it needs to be
applied to become a chunk that you can call upon on your own.

By /visualising why/ you're doing what you're doing, you can slow your decision
making down; your intended application of a chunk is moved from System 1
thinking, which is rapid and instinctive, to System 2 thinking, which is slow
and reasoned.

Here's the problem with "superlearners". They typically have a larger working
memory, and their neuronal links form very quickly. But there are tradeoffs to
this. Einstellung is more of a problem for these people because their working
memory is indeed large, but also rigid; information is held on to tightly. This
means that once it's chunked, it's harder to apply to new situations and use
creatively.

So, if you find it harder to chunk, just remember that your /application/ of a
chunk is likely to be much more flexible and creative than those who committed
the material to memory faster. As we saw earlier in this section, the entire
point of learning is in application... So what side of the tradeoff between
committal and application would you prefer to sit on?

With this in mind, remember that deliberate practice can help elevate you to
stronger chunk creation and deeper understanding of the material. *Impostor
Syndrome* is where we see the capabilities of others and become discouraged.
Hopefully this explanation of how capable learners may face troubles in creative
application will help alleviate it somewhat. Just know that it's incredibly
common, but tradeoffs exist everywhere; that's why diversity is so emphasised in
modern corporate culture. We all bring different skills and perspectives to the
table.
**** The Mental Game
Myelin Sheaths are coatings for neuron links that help transfer signals between
neurons. As teenagers, our myelin sheaths are not fully formed. This is why they
are impulsive; the connections between intention & control systems of the brain
are not fully formed yet.

The formation of myelin sheaths is sped up through usage of those specific
neurons; so there is significant evidence that the brain can be changed by the
way that we *think*.

Diversifying our thinking, and working persistently at learning material in
different ways, from different angles, enables us to form a much better
understanding of the learning material. Therefore, we are able to use those
chunks more creatively.

A technique to help do this is to try and develop a /cool dispassion/ to deal
with detractors and setbacks. Consider this a reasonable, temporary lack of
empathy. We tend to believe by default what most people say, which is harmful
when you have people say things like "you'll never be good at this"; most people
believe in the general goodheartedness of others. Taking pride in what you
succeed in and what you believe you can do can /stabilise/ us, and keep us
focused on a goal we'd otherwise give up on if we give in to setbacks in this way.
**** Teamwork
The Left & Right Hemisphere model for personality is thoroughly debunked. But we
know for a fact that the two sides perform different functions. For example, big
picture and contextual thinking *require* the right hemisphere; performing
"reality checks" is one such function. You can think of it as your mental
devil's advocate.

The Left side of your brain is associated with focused mode thinking on
technical detail. Using just this side of your brain, it is easy to make
incorrect assumptions and mistakes, as questioning yourself and testing your
hypotheses is part of the wider contextual thinking governed by the Right side.

Going back and *checking* work provides the chance for the less dogmatic Right
side to participate in the thinking process. Using just the Left, you can end up
with Tunnel Vision very easily.

This is where teamwork comes in. Working through problems in a group forces that
checking process, helping you catch areas where your own thinking has gone
wrong. It's kind of like an crowdsourced "diffuse mode reality check" process,
to help you draw links between areas you hadn't personally thought of and
correct your thinking when you've made incorrect assumptions. Working in groups
also necessitates communication, and therefore recall of the learning material,
which facilitates the chunk formation process.

...Just don't expect good results if no one is actually working.

*** Testing
This section will be focused on Testing strategies. These aren't just applicable
to Exams, but they can apply to many high-stakes situations, like job
interviews, big presentations, etc; but you may need to adapt some of the advice.

You can also adapt some of these techniques to personally devised "mini tests"
for when you're learning new material. In [[#learning-how-to-learn-1][Weeks 1]] & [[#learning-how-to-learn-2][2]] we discussed how testing
yourself is the strongest process through which you can learn new material.
**** Test Checklist
This checklist was developed by Richard Felder for engineering students, some
are more applicable to a non-uni setting than others. If you can't say "yes" to
every applicable point on this list, you aren't ready.
1. Did you make a serious effort to understand the text?
2. Did you work with peers, at least for checking work?
3. Did you attempt to outline every problem solution?
4. Did you actively participate in group discussions about problems?
5. Did you consult with the instructor when stuck on a particularly hard problem?
6. Did you understand every problem solution?
7. Did you seek out explanations for solutions that you didn't understand?
8. Did you complete a recommended study guide?
9. Did you outline problem solutions _quickly_, without focusing too intently on
   the detail or maths behind that solution?
10. Did you quiz peers on problems & the study guide?
11. Did you participate in revision sessions?
12. Did you sleep properly the night before?

**** The Hard Start - Jump To Easy Technique
Think back to the last time you took an exam. What was your strategy when you
started it? Did you flip to question 1, and start making your way through the
paper? Did you perhaps flick through to see what monstrosities awaited in the
final questions? I bet you didn't start trying to work through the hardest
questions first, though.

Let's consider everything we've learned in this course. Diffuse mode can work
concurrently to Focused mode on other tasks that have been imprinted on working
memory. With this in mind, the most time-efficient way to work through an exam
is to start on the hardest question(s) first, then switch contexts to the easy
questions to work through. This allows your diffuse mode to take over on the
hard problem, let your zombies jump on it and start dismantling it in the
background, while you grind through the easy stuff. Then after at least 5
minutes, switch back to the hard problem, and try working through it a bit more.

This strategy is completely counterintuitive. Starting Hard, then Jumping To
Easy is a strange way of working, but it can really work well for some people.
By leveraging your brain's natural parallel capabilities, you can accomplish
more than if you tackled the problems in order.

It's a bit like working as a chef; handling lots of different things at once
enables you to manage many simultaneous process. Even better than that though is
that by allowing your diffuse mode to work in the background, you're more likely
to be creative with the solutions you eventually do come up with! So even if the
time saving was negligible, you'll do better in the test because you're more
likely to break through the novelty of a never-before-seen question by applying
known methods in creative ways to solve the problem.

However, this process doesn't work for everybody; some people's brains just
aren't predisposed to this kind of working, so don't just rock up into a test
and expect to smash it without testing the method first. Give it a go on a mock
or a timed practice paper, and see how you go.
**** Stress Techniques
Cortisol is a steroid hormone that is released whenever you're feeling stressed.
It's responsible for the sweaty palms and general anxiety felt by stressed
individuals. The release of cortisol doesn't automatically mean that you're
about to decompose into an anxious mess though! Research shows that the "story
you tell yourself about the stress you're experiencing" has more of an effect
on your general mental state than your cortisol levels. This is why positive
mental attitudes are so important!

Keeping that positive mental attitude (and regulating your self-talk so it is
has a more "reinforcing" tone than a destructive one) therefore minimises
anxiety, and wards away our bodies' biological fight-or-flight response to
stress. Deep breathing helps counteract that response as well; do it by trying
to breathe into your belly, not your chest. As always, practice makes perfect;
but *both these techniques implemented deliberately and consistently in response
to stressful situations increase their speed and effectiveness*!
**** Recall
How can you improve your brain's ability to recall information? The best
practice you can do to develop your brain's searching abilities for specific
material is to use multiple choice quizzes, cover the answers and try to answer
the question without the aid of the multiple choice answers. This stimulates
your brain's recall pathways so that when you're faced with the same (or
similar) questions, you have a better chance of successfully recalling the
information.

This is why Anki is so effective. A personal story: I like using Clozemaster to
practice my languages. The core "game loop" is that you fill the gap in a
sentence by picking the right word from a multiple choice list. This is a
"Cloze" card, in spaced repetition learning systems like Anki. You have the
choice to enable multiple choices or not; by enabling multiple choice but
attempting to answer the question mentally without the aid of those choices, I'm
more likely to get the answer right when the question is repeated to me after a
certain time period based on spaced repetition.
**** Rest
You need both your focused and your diffuse modes to be successful in learning
new material; don't run yourself ragged and complain you messed up your exam or
interview. When was the last time someone prepared for a marathon by running a
marathon the day before race day?
**** Face your fears
The final piece of advice is to reduce your stress responses by making a Plan B
in case everything goes to pot. Imagine your absolute worst case scenarios if
you fail this exam, or that interview; what would Plan B be? By facing the fear
of failure in this way and putting in plans to mitigate them we can more easily
wrangle ourselves into the golden "Win Win" pattern of thinking. Getting
yourself into that place means you're at peace with all possible outcomes of an
event. This place is where most people perform at their best.
*** Wrap Up
This week has been a bit more disparate than the previous 3 in terms of its
theme; we've learned less about our mental processes and how we think and more
about how we can apply the knowledge from the other weeks into techniques on
dealing with challenging situations and learning in general.

This post will be followed by a review post, in which I go over the course in
higher level of detail and give my opinions on the MOOC in general. I hope that
these notes help supplement the material from the course, as there really is no
replacement for learning from the experts, and that's certainly what Dr Barbara
Oakley and Dr Terrence Sejnowski are!

